# pandasの復習

[![Open In Colab](https://colab.research.google.com/assets/colab-badge.svg)](https://colab.research.google.com/github/shinchu/dataviz-notebooks/blob/main/week_3/pandas-review.ipynb)

練習問題は、[gotty21/basic_pandas-64-knocks](https://github.com/gotty21/basic_pandas-64-knocks)をから抜粋しました。

講義で習っていない部分は、公式ドキュメントを調べてみてください。

* [10 minutes to pandas](https://pandas.pydata.org/docs/user_guide/10min.html)
* [pandas documentation](https://pandas.pydata.org/docs/index.html)

## 事前準備

データフレームを初期化するための関数`initialize()`を作ります。作業前にこの2つのセルを実行しましょう。

`openpyxl`はExcelファイルの読み込みに必要です。必要に応じてインストールしてください。

In [1]:
!pip install openpyxl

Requirement already satisfied: openpyxl in /Users/shu/.virtualenvs/datatools/lib/python3.10/site-packages (3.0.10)
Requirement already satisfied: et-xmlfile in /Users/shu/.virtualenvs/datatools/lib/python3.10/site-packages (from openpyxl) (1.1.0)

In [2]:
import pandas as pd

def initialize(flag=0):
    if flag == 0:
        return pd.read_csv("https://raw.githubusercontent.com/shinchu/dataviz-notebooks/main/data/week_3/main.csv")
    if flag == 1:
        return pd.read_csv("https://raw.githubusercontent.com/shinchu/dataviz-notebooks/main/data/week_3/add.csv")
    if flag == 2:
        return pd.read_excel("https://github.com/shinchu/dataviz-notebooks/blob/main/data/week_3/data.xlsx?raw=true")
    else:
        print("Please specify numbers between 0 to 2.")
        return None

## データの読み込み・確認

### pandasインポート

【演習】pandasライブラリをpdという名前でインポートしてください

In [2]:
# your code goes here

In [3]:
# answer

import pandas as pd

### csvファイルの読み込み

【演習】

URL: https://raw.githubusercontent.com/shinchu/dataviz-notebooks/main/data/week_3/main.csv

上記URLからmain.csvを読み込んでデータフレームを作成し、dfという変数に格納してください

In [4]:
# your code goes here

In [4]:
# answer

file = "https://raw.githubusercontent.com/shinchu/dataviz-notebooks/main/data/week_3/main.csv"
df = pd.read_csv(file)

In [5]:
df

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,FLAG_MOBIL,REGION_POPULATION_RELATIVE,OWN_CAR_AGE
0,100002,1,Cash loans,M,N,Y,0,202500.0,1,0.018801,NaN
1,100003,0,Cash loans,F,N,N,0,270000.0,1,0.003541,NaN
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,1,0.010032,26.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,1,0.008019,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,1,0.028663,NaN
...,...,...,...,...,...,...,...,...,...,...,...
1995,102337,1,Cash loans,F,N,Y,0,49500.0,1,0.010643,NaN
1996,102338,0,Cash loans,M,Y,Y,0,135000.0,1,0.018634,18.0
1997,102339,0,Revolving loans,F,Y,N,1,135000.0,1,0.003069,1.0
1998,102341,0,Revolving loans,F,N,N,2,202500.0,1,0.072508,NaN
1999,102343,0,Cash loans,M,N,Y,1,180000.0,1,0.008474,NaN

【演習】

URL: https://raw.githubusercontent.com/shinchu/dataviz-notebooks/main/data/week_3/add.csv

上記URLからadd.csvを読み込んでデータフレームを作成し、addという変数に格納

In [5]:
# your code goes here

In [6]:
# answer

file = "https://raw.githubusercontent.com/shinchu/dataviz-notebooks/main/data/week_3/add.csv"
add = pd.read_csv(file)

In [7]:
add

      SK_ID_CURR  SK_ID_BUREAU  DAYS_CREDIT
0         215354       5714462         -497
1         215354       5714463         -208
2         215354       5714464         -203
3         215354       5714465         -203
4         215354       5714466         -629
...          ...           ...          ...
1995      324970       5716937        -1593
1996      409869       5716939        -2265
1997      409869       5716940         -608
1998      409869       5716941        -2440
1999      120869       5716947        -2697

[2000 rows x 3 columns]

### DataFrameのサイズの確認

【演習】dfのサイズを確認してください。

In [8]:
# 次の一行でデータフレームdfを初期化します。演習を行う前に都度実行してください。

df = initialize(0)

In [8]:
# your code goes here

In [10]:
# answer

df.shape

(2000, 11)

### DataFrameのレコード数の確認

【演習】dfのレコード数を確認してください。

In [11]:
df = initialize(0)

In [10]:
# your code goes here

In [12]:
# answer

len(df)

2000

## ラベル

### DataFrameのカラム名の取得

【演習】dfのcolumn名をリスト形式で取得してください。

In [14]:
df = initialize(0)

In [11]:
# your code goes here

In [15]:
# answer

list(df.columns)

['SK_ID_CURR',
 'TARGET',
 'NAME_CONTRACT_TYPE',
 'CODE_GENDER',
 'FLAG_OWN_CAR',
 'FLAG_OWN_REALTY',
 'CNT_CHILDREN',
 'AMT_INCOME_TOTAL',
 'FLAG_MOBIL',
 'REGION_POPULATION_RELATIVE',
 'OWN_CAR_AGE']

### DataFrameのカラム名の一部を変更

【演習】dfのcolumn名CODE_GENDERをGENDERに変更してください。

In [16]:
df = initialize(0)

In [12]:
# your code goes here

In [18]:
# answer

df.rename(columns={"CODE_GENDER": "GENDER"}, inplace=True)

### DataFrameのカラム名をすべて変更

【演習】column名をno1～no11というstr型の名前に変更してください。「リスト内包表記」を使用すると簡単です。調べてみてください。

In [19]:
df = initialize(0)

In [22]:
# your code goes here

In [24]:
# answer

print(len(df.columns))

df.columns = [f"no{i}" for i in range(1, 12)]

11

In [25]:
df

,no1,no2,no3,no4,no5,no6,no7,no8,no9,no10,no11
0,100002,1,Cash loans,M,N,Y,0,202500.0,1,0.018801,NaN
1,100003,0,Cash loans,F,N,N,0,270000.0,1,0.003541,NaN
2,100004,0,Revolving loans,M,Y,Y,0,67500.0,1,0.010032,26.0
3,100006,0,Cash loans,F,N,Y,0,135000.0,1,0.008019,NaN
4,100007,0,Cash loans,M,N,Y,0,121500.0,1,0.028663,NaN
...,...,...,...,...,...,...,...,...,...,...,...
1995,102337,1,Cash loans,F,N,Y,0,49500.0,1,0.010643,NaN
1996,102338,0,Cash loans,M,Y,Y,0,135000.0,1,0.018634,18.0
1997,102339,0,Revolving loans,F,Y,N,1,135000.0,1,0.003069,1.0
1998,102341,0,Revolving loans,F,N,N,2,202500.0,1,0.072508,NaN
1999,102343,0,Cash loans,M,N,Y,1,180000.0,1,0.008474,NaN

## 各列のデータの確認

###  任意の列のユニーク（一意）な要素を確認

In [26]:
df = initialize(0)

【演習】dfのCODE_GENDER列のユニークな要素を確認してください。

In [27]:
# your code goes here

In [31]:
# answer

df["CODE_GENDER"].value_counts()

F    1292
M     708
Name: CODE_GENDER, dtype: int64

### 各列のユニークな要素の数を確認

【演習】dfの各列のユニークな要素の数を出力してください。

In [32]:
df = initialize(0)

In [12]:
# your code goes here

In [35]:
# answer

df.nunique()

SK_ID_CURR                    2000
TARGET                           2
NAME_CONTRACT_TYPE               2
CODE_GENDER                      2
FLAG_OWN_CAR                     2
FLAG_OWN_REALTY                  2
CNT_CHILDREN                     5
AMT_INCOME_TOTAL               139
FLAG_MOBIL                       1
REGION_POPULATION_RELATIVE      78
OWN_CAR_AGE                     36
dtype: int64

### 任意の列のユニークな要素の数とその出現回数を確認

【演習】dfのCNT_CHILDREN列の要素とその出現回数を確認してください。

In [36]:
df = initialize(0)

In [39]:
# your code goes here

In [40]:
# answer

df["CNT_CHILDREN"].value_counts()

0    1414
1     388
2     170
3      26
4       2
Name: CNT_CHILDREN, dtype: int64

## データの取り出し

### 任意の１つの列の取り出し

【演習】dfのTARGETの列のみ表示してください。

In [41]:
df = initialize(0)

In [12]:
# your code goes here

In [42]:
# answer

df["TARGET"]

0       1
1       0
2       0
3       0
4       0
       ..
1995    1
1996    0
1997    0
1998    0
1999    0
Name: TARGET, Length: 2000, dtype: int64

【演習】dfの左から3番目の列のみ表示してください。

In [43]:
df = initialize(0)

In [48]:
# your code goes here

In [46]:
# answer

df.iloc[:, 2]

0            Cash loans
1            Cash loans
2       Revolving loans
3            Cash loans
4            Cash loans
             ...
1995         Cash loans
1996         Cash loans
1997    Revolving loans
1998    Revolving loans
1999         Cash loans
Name: NAME_CONTRACT_TYPE, Length: 2000, dtype: object

### 複数の列の取り出し

【演習】dfのTARGET列とCODE_GENDER列のみ表示してください。

In [51]:
df = initialize(0)

In [12]:
# your code goes here

In [53]:
# answer

df[["TARGET", "CODE_GENDER"]]

      TARGET CODE_GENDER
0          1           M
1          0           F
2          0           M
3          0           F
4          0           M
...      ...         ...
1995       1           F
1996       0           M
1997       0           F
1998       0           F
1999       0           M

[2000 rows x 2 columns]

【演習】dfのTARGET列とCODE_GENDER列までの列を表示してください。

In [54]:
df = initialize(0)

In [12]:
# your code goes here

In [64]:
# answer

df.loc[:, "TARGET":"CODE_GENDER"]

      TARGET NAME_CONTRACT_TYPE CODE_GENDER
0          1         Cash loans           M
1          0         Cash loans           F
2          0    Revolving loans           M
3          0         Cash loans           F
4          0         Cash loans           M
...      ...                ...         ...
1995       1         Cash loans           F
1996       0         Cash loans           M
1997       0    Revolving loans           F
1998       0    Revolving loans           F
1999       0         Cash loans           M

[2000 rows x 3 columns]

### 条件検索

【演習】CODE_GENDER列が'F'かつAMT_INCOME_TOTAL列が500000以上のデータポイントを表示してください。

In [68]:
df = initialize(0)

In [12]:
# your code goes here

In [74]:
# answer

df.query("CODE_GENDER == 'F' and AMT_INCOME_TOTAL >= 500000")

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,FLAG_MOBIL,REGION_POPULATION_RELATIVE,OWN_CAR_AGE
332,100380,0,Cash loans,F,N,Y,0,630000.0,1,0.072508,NaN
930,101073,1,Cash loans,F,Y,N,0,540000.0,1,0.008474,18.0
1064,101235,0,Revolving loans,F,N,Y,0,720000.0,1,0.010147,NaN
1568,101839,0,Cash loans,F,N,N,0,630000.0,1,0.020713,NaN
1586,101857,0,Cash loans,F,N,Y,0,720000.0,1,0.046220,NaN
1644,101929,1,Revolving loans,F,Y,Y,0,697500.0,1,0.046220,7.0
1723,102015,0,Cash loans,F,N,Y,0,1935000.0,1,0.007114,NaN
1793,102097,0,Revolving loans,F,Y,Y,1,540000.0,1,0.032561,16.0

## ソート

### 任意の一列で昇順ソート

【演習】dfのAMT_INCOME_TOTALの列で昇順ソートして表示してください。

In [75]:
df = initialize(0)

In [12]:
# your code goes here

In [78]:
# answer

df.sort_values("AMT_INCOME_TOTAL", ascending=True)

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,FLAG_MOBIL,REGION_POPULATION_RELATIVE,OWN_CAR_AGE
1678,101965,0,Cash loans,F,N,N,0,25650.0,1,0.018850,NaN
495,100572,0,Cash loans,F,N,Y,0,31500.0,1,0.031329,NaN
283,100326,1,Cash loans,M,Y,Y,0,36000.0,1,0.018209,27.0
1221,101442,0,Cash loans,F,N,N,0,36000.0,1,0.018850,NaN
651,100743,0,Cash loans,F,N,Y,0,38250.0,1,0.018850,NaN
...,...,...,...,...,...,...,...,...,...,...,...
1064,101235,0,Revolving loans,F,N,Y,0,720000.0,1,0.010147,NaN
319,100366,0,Revolving loans,M,Y,Y,0,765000.0,1,0.002506,3.0
1238,101461,0,Cash loans,M,Y,Y,0,810000.0,1,0.072508,5.0
1504,101769,0,Revolving loans,M,Y,Y,0,1080000.0,1,0.072508,7.0
1723,102015,0,Cash loans,F,N,Y,0,1935000.0,1,0.007114,NaN

### 任意の一列で降順ソート

【演習】dfのAMT_INCOME_TOTALの列で降順ソート表示してください。

In [ ]:
df = initialize(0)

In [12]:
# your code goes here

In [79]:
# answer

df.sort_values("AMT_INCOME_TOTAL", ascending=False)

,SK_ID_CURR,TARGET,NAME_CONTRACT_TYPE,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,FLAG_MOBIL,REGION_POPULATION_RELATIVE,OWN_CAR_AGE
1723,102015,0,Cash loans,F,N,Y,0,1935000.0,1,0.007114,NaN
1504,101769,0,Revolving loans,M,Y,Y,0,1080000.0,1,0.072508,7.0
1238,101461,0,Cash loans,M,Y,Y,0,810000.0,1,0.072508,5.0
319,100366,0,Revolving loans,M,Y,Y,0,765000.0,1,0.002506,3.0
1586,101857,0,Cash loans,F,N,Y,0,720000.0,1,0.046220,NaN
...,...,...,...,...,...,...,...,...,...,...,...
651,100743,0,Cash loans,F,N,Y,0,38250.0,1,0.018850,NaN
1221,101442,0,Cash loans,F,N,N,0,36000.0,1,0.018850,NaN
283,100326,1,Cash loans,M,Y,Y,0,36000.0,1,0.018209,27.0
495,100572,0,Cash loans,F,N,Y,0,31500.0,1,0.031329,NaN
1678,101965,0,Cash loans,F,N,N,0,25650.0,1,0.018850,NaN

## 統計量

### 基本統計量

【演習】dfのAMT_INCOME_TOTAL列の平均、中央値、合計、最大値、最小値、最頻値をそれぞれ出力してください。

In [80]:
df = initialize(0)

In [12]:
# your code goes here

In [95]:
# answer

def mode(x):
    return x.value_counts().index[0]

df["AMT_INCOME_TOTAL"].agg(['mean', 'median', 'sum', 'max', 'min', mode])

mean      1.701188e+05
median    1.440000e+05
sum       3.402375e+08
max       1.935000e+06
min       2.565000e+04
mode      1.125000e+05
Name: AMT_INCOME_TOTAL, dtype: float64

### 要約統計量

【演習】dfのAMT_INCOME_TOTAL列の要約統計量を出力してください。

In [96]:
df = initialize(0)

In [97]:
# your code goes here

In [98]:
# answer

df["AMT_INCOME_TOTAL"].describe()

count    2.000000e+03
mean     1.701188e+05
std      1.017594e+05
min      2.565000e+04
25%      1.125000e+05
50%      1.440000e+05
75%      2.025000e+05
max      1.935000e+06
Name: AMT_INCOME_TOTAL, dtype: float64

### groupby

【演習】dfのCODE_GENDERで集約し、それぞれのAMT_INCOME_TOTALの最大値を出力してください。

In [99]:
df = initialize(0)

In [12]:
# your code goes here

In [103]:
# answer

df.groupby("CODE_GENDER")["AMT_INCOME_TOTAL"].agg("max")

CODE_GENDER
F    1935000.0
M    1080000.0
Name: AMT_INCOME_TOTAL, dtype: float64

【演習】dfのCODE_GENDERごとにNAME_CONTRACT_TYPEで集約し、各グループ内の平均と分散を出力してください。また、出力を見やすくするためにindexをリセットしてください。

In [102]:
df = initialize(0)

In [12]:
# your code goes here

In [104]:
# answer

df.groupby(["CODE_GENDER", "NAME_CONTRACT_TYPE"]).agg(["mean", "std"]).reset_index()

/var/folders/lb/hwh92jm536136ctj9b7sdtl80000gn/T/ipykernel_37582/1463348131.py:3: FutureWarning: ['FLAG_OWN_CAR', 'FLAG_OWN_REALTY'] did not aggregate successfully. If any error is raised this will raise in a future version of pandas. Drop these columns/ops to avoid this warning.
  df.groupby(["CODE_GENDER", "NAME_CONTRACT_TYPE"]).agg(["mean", "std"]).reset_index()

  CODE_GENDER NAME_CONTRACT_TYPE     SK_ID_CURR                TARGET  \
                                           mean         std      mean
0           F         Cash loans  101168.925386  664.974302  0.059177
1           F    Revolving loans  101225.261905  735.737064  0.023810
2           M         Cash loans  101167.272871  691.985282  0.102524
3           M    Revolving loans  101025.500000  700.121853  0.108108

            CNT_CHILDREN           AMT_INCOME_TOTAL                FLAG_MOBIL  \
        std         mean       std             mean            std       mean
0  0.236056     0.385077  0.683402    156289.567886   96264.039839        1.0
1  0.153064     0.452381  0.744120    158903.500000  110220.798071        1.0
2  0.303575     0.435331  0.732725    189622.313091   91758.722010        1.0
3  0.312636     0.432432  0.812253    240020.270270  174150.943016        1.0

       REGION_POPULATION_RELATIVE           OWN_CAR_AGE
   std                       mean       std        mean        std
0  0.0                   0.020755  0.013840   12.677165  15.198233
1  0.0                   0.022309  0.014682   10.875000  14.825327
2  0.0                   0.021848  0.014474   11.465940  10.932646
3  0.0                   0.025702  0.017417   12.500000  14.005493

## ファイル出力

### csvファイルに出力

【演習】dfを、行番号、列番号なしでoutput.csvという名前で出力してください。

In [105]:
df = initialize(0)

In [12]:
# your code goes here

In [106]:
# answer

df.to_csv("./output.csv", index=False, header=False)